---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainBothUandV
source: html/e8f7ed48-e8a2-5e8e-f037-64deec6eca32.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainBothUandV Property

A chain formed by these curve elements is trying to be both U- and V- splitter

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainBothUandV { get; }
```